# 출력 print() 함수
'''
값을 콘솔에 출력하는 내장 함수
'''
# 1. 사용자에게 메시지를 전달하거나, 변수의 값 등을 출력할 때 사용
# 2. 디버깅 시 코드 흐름을 추적하거나 값 확인용으로 매우 자주 사용
'''
- sep : sep = "여러값 구분자"
        하나의 print 안에 여러 값을 출력할 때 구분자 지정(default : blank)
- end : end = "줄바꿈 구분자"
        여러 print 사용 시 줄바꿈 구분자 지정(default : blank)
'''

print("Hello World!")
print("Hello World!")
print("Hello World!")

#######################################################################
# 주석
'''
코드에 대한 설명이나 메모를 위해 작성하는 텍스트
'''

"주석"
# 1. 코드의 의도나 기능을 설명하여 다른 사람이 이해하기 쉽도록 도움
# 2. 일시적으로 코드를 비활성화할 때 사용
# 3. 다른 사람과 협업할 때 소통
'주석'
